{
  "src/App.jsx": "This file serves as the main application component that sets up routing and overall layout structure for the Strikeline Scorer website. It establishes the dark gradient background theme and manages navigation between different pages. The component wraps all pages with a consistent navbar and footer, ensuring a cohesive user experience throughout the site.\n\nKeywords: ['routing', 'layout', 'navigation', 'main-app']\nComponent Type: ['layout']\nFunctionality: ['Manages application routing and provides consistent layout structure with navbar and footer']\nUse Case: ['Entry point for the entire website application']\nRelated Files: ['src/components/Navbar.jsx', 'src/components/Footer.jsx', 'src/pages/HomePage.jsx']",
  "src/components/Navbar.jsx": "This file creates a responsive navigation bar component with a modern dark theme and professional styling. It includes the Strikeline Scorer branding with a target icon, navigation links, and a mobile hamburger menu. The navbar features active link highlighting, smooth transitions, and a prominent call-to-action button for user engagement.\n\nKeywords: ['navigation', 'responsive', 'mobile-menu', 'branding']\nComponent Type: ['UI']\nFunctionality: ['Provides site navigation with responsive design and active state management']\nUse Case: ['Primary navigation across all pages of the website']\nRelated Files: ['src/App.jsx', 'src/components/Footer.jsx']",
  "src/components/Footer.jsx": "This file creates a comprehensive footer component that provides essential company information, navigation links, and contact details. It features a multi-column layout with the company branding, social media links, quick navigation, and contact information. The footer maintains the dark theme consistency and includes proper spacing and typography hierarchy.\n\nKeywords: ['footer', 'contact-info', 'navigation', 'branding']\nComponent Type: ['UI']\nFunctionality: ['Provides site footer with company info, links, and contact details']\nUse Case: ['Bottom section of all website pages with essential information']\nRelated Files: ['src/App.jsx', 'src/components/Navbar.jsx']",
  "src/components/Button.jsx": "This file creates a reusable button component with multiple variants, sizes, and interactive animations. It includes primary, secondary, outline, and ghost button styles with consistent hover effects and focus states. The component uses Framer Motion for subtle scale animations and maintains accessibility standards with proper focus indicators.\n\nKeywords: ['button', 'reusable', 'variants', 'animations']\nComponent Type: ['UI']\nFunctionality: ['Provides consistent button styling and interactions across the application']\nUse Case: ['Call-to-action buttons, form submissions, and interactive elements']\nRelated Files: ['src/pages/HomePage.jsx', 'src/pages/ContactPage.jsx', 'src/pages/PricingPage.jsx']",
  "src/components/FeatureCard.jsx": "This file creates a reusable feature card component designed to showcase individual features or services with icons, titles, descriptions, and feature lists. The card includes hover effects, smooth animations, and a consistent dark theme styling. It's optimized for displaying product features in an organized and visually appealing manner.\n\nKeywords: ['feature-card', 'reusable', 'animations', 'hover-effects']\nComponent Type: ['UI']\nFunctionality: ['Displays feature information with icon, title, description, and feature list']\nUse Case: ['Feature showcases, service listings, and product highlights']\nRelated Files: ['src/pages/FeaturesPage.jsx', 'src/pages/HomePage.jsx']",
  "src/pages/HomePage.jsx": "This file creates the main homepage featuring a compelling hero section, feature previews, value proposition, and call-to-action sections. It showcases the Strikeline Scorer system with professional animations, feature highlights, and clear pricing information. The page is designed to convert visitors into potential customers through strategic content placement and engaging visuals.\n\nKeywords: ['homepage', 'hero-section', 'features', 'value-proposition', 'cta']\nComponent Type: ['layout']\nFunctionality: ['Main landing page showcasing the product and driving user engagement']\nUse Case: ['Primary entry point for website visitors and lead generation']\nRelated Files: ['src/components/Button.jsx', 'src/components/FeatureCard.jsx', 'src/pages/ContactPage.jsx']",
  "src/pages/FeaturesPage.jsx": "This file creates a comprehensive features page that details all the applications and capabilities of the Strikeline Scorer system. It showcases the five core applications with detailed feature lists, technical capabilities, and system benefits. The page is designed to educate potential customers about the complete feature set and drive them toward making a purchase decision.\n\nKeywords: ['features', 'applications', 'detailed-specs', 'system-benefits']\nComponent Type: ['layout']\nFunctionality: ['Comprehensive feature showcase with detailed descriptions and benefits']\nUse Case: ['Product education and feature comparison for potential customers']\nRelated Files: ['src/components/FeatureCard.jsx', 'src/components/Button.jsx', 'src/pages/PricingPage.jsx']",
  "src/pages/PricingPage.jsx": "This file creates a professional pricing page for the Strikeline Scorer system, featuring a single comprehensive package at 5,000 MAD. The page emphasizes the one-time payment model with no monthly fees, includes a detailed feature list, and provides clear call-to-action buttons for potential customers to get started.\n\nKeywords: ['pricing', 'package', 'features', 'payment', 'value-proposition']\nComponent Type: ['layout']\nFunctionality: ['Displays pricing information and package details with animated feature list']\nUse Case: ['Showcasing product pricing to potential customers and converting leads']\nRelated Files: ['src/components/Button.jsx', 'src/pages/ContactPage.jsx']",
  "src/pages/HowItWorksPage.jsx": "This file creates a comprehensive how-it-works page that explains the 4-step process for getting Strikeline Scorer installed and running. It includes visual step indicators, detailed system component explanations, and clear call-to-action buttons to guide potential customers through the journey from initial contact to full implementation.\n\nKeywords: ['process', 'steps', 'installation', 'system-components', 'workflow']\nComponent Type: ['layout']\nFunctionality: ['Explains the implementation process and system features with animated step indicators']\nUse Case: ['Educating potential customers about the setup process and system capabilities']\nRelated Files: ['src/components/Button.jsx', 'src/pages/ContactPage.jsx', 'src/pages/PricingPage.jsx']",
  "src/pages/ContactPage.jsx": "This file creates a comprehensive contact page featuring a contact form, multiple communication methods (WhatsApp, email, phone), business hours, and service area information. The form integrates with WhatsApp for instant communication and includes proper form validation and user experience enhancements.\n\nKeywords: ['contact', 'form', 'whatsapp', 'communication', 'business-hours']\nComponent Type: ['layout']\nFunctionality: ['Provides multiple contact methods and form submission with WhatsApp integration']\nUse Case: ['Enabling potential customers to reach out for consultations and support']\nRelated Files: ['src/components/Button.jsx', 'src/pages/PricingPage.jsx', 'src/pages/HowItWorksPage.jsx']",
  "src/context/LanguageContext.jsx": "This file creates a React context provider for managing multilingual functionality across the entire application. It handles language switching, text direction changes for RTL languages like Arabic, and provides translation functions to all components. The context manages the current language state, persists user preferences in localStorage, and automatically updates the document's language attributes and text direction when the language changes.\n\nKeywords: ['language', 'context', 'translation', 'RTL', 'Arabic', 'multilingual']\nComponent Type: ['functional']\nFunctionality: ['Manages global language state and provides translation utilities']\nUse Case: ['Language switching, internationalization, RTL support']\nRelated Files: ['src/utils/translations.js', 'src/App.jsx', 'src/components/Navbar.jsx']",
  "src/utils/translations.js": "This file contains comprehensive translation data for the entire website in three languages: English, French, and Arabic. It provides structured translation objects for all website sections including navigation, homepage content, features, pricing, contact information, and footer text. The translations are organized hierarchically to match the component structure and enable easy access through dot notation.\n\nKeywords: ['translations', 'multilingual', 'Arabic', 'French', 'English', 'i18n']\nComponent Type: ['data']\nFunctionality: ['Provides translation data for all website content across three languages']\nUse Case: ['Internationalization, language switching, multilingual support']\nRelated Files: ['src/context/LanguageContext.jsx', 'src/components/Navbar.jsx', 'src/pages/HomePage.jsx']"
}